# lol.py

import random

lanes = ['탑', '정글', '미드', '봇', '서포터']
keystones = ['집중 공격', '치명적 속도', '기민한 발놀림', '정복자', '감전', '포식자', '어둠의 수확', '칼날비', '콩콩이 소환', '신비로운 유성', '난입',
             '착취의 손아귀', '여진', '수호자', '빙결 강화', '봉인 풀린 주문서', '프로토타입: 만능의 돌']
items = ['돌풍', '크라켄 학살자', '불멸의 철갑궁', '서리불꽃 건틀릿', '터보 화공 탱크', '태양불꽃 방패', '드락사르의 황혼검', '월식', '자객의 발톱', '리안드리의 고뇌',
         '루덴의 폭풍', '만년서리', '마법공학 로켓 벨트', '균열 생성기', '밤의 수확자', '선혈포식자', '발걸음 분쇄기', '신성한 파괴자', '삼위일체', '슈렐리아의 군가',
         '강철의 솔라리 펜던트', '제국의 명령', '월석 재생기']
champions = ['가렌', '갈리오', '갱플랭크', '그라가스', '그레이브즈', '그웬', '나르', '나미', '나서스', '노틸러스', '녹턴', '누누와 윌럼프', '니달리', '니코',
             '다리우스', '다이애나', '드레이븐', '라이즈', '라칸', '람머스', '럭스', '럼블', '레넥톤', '레오나', '렉사이', '렐', '렝가', '루시안', '룰루', '르블랑',
             '리 신', '리븐', '리산드라', '릴리아', '마스터 이', '마오카이', '말자하', '말파이트', '모데카이저', '모르가나', '문도 박사', '미스 포츈',
             '바드', '바루스', '바이', '베이가', '베인', '벨코즈', '볼리베어', '브라움', '브랜드', '블라디미르', '블리츠크랭크', '비에고', '빅토르', '뽀삐', '사미라',
             '사이온', '사일러스', '샤코', '세나', '세라핀', '세주아니', '세트', '소나', '소라카', '쉔', '쉬바나', '스웨인', '스카너', '시비르', '신 짜오',
             '신드라', '신지드', '쓰레쉬', '아리', '아무무', '아우렐리온 솔', '아이번', '아지르', '아칼리', '아트록스', '아펠리오스', '알리스타', '애니', '애니비아',
             '애쉬', '야스오', '에코', '엘리스', '오공', '오른', '오리아나', '올라프', '요네', '요릭', '우디르', '우르곳', '워윅', '유미', '이렐리아', '이블린',
             '이즈리얼', '일라오이', '자르반 4세', '자야', '자이라', '자크', '잔나', '잭스', '제드', '제라스', '제이스', '조이', '직스', '진', '질리언',
             '징크스', '초가스', '카르마', '카밀', '카사딘', '카서스', '카시오페아', '카이사', '카직스', '카타리나', '칼리스타', '케넨', '케이틀린', '케인', '케일',
             '코그모', '코르키', '퀸', '클레드', '키아나', '킨드레드', '타릭', '탈론', '탈리야', '탐 켄치', '트런들', '트리스타나', '트린다미어',
             '트위스티드 페이트', '트위치', '티모', '파이크', '판테온', '피들스틱', '피오라', '피즈', '하이머딩거', '헤카림']


def getResult(text):
    words = text.split()

    result = {"라인": '', "룬": '', "아이템": '', '챔피언': ''}

    for word in words:
        if word == "라인":
            index = random.randrange(0, len(lanes))
            result["라인"] = lanes[index]
        elif word == "룬":
            index = random.randrange(0, len(keystones))
            result["룬"] = keystones[index]
        elif word == "아이템":
            index = random.randrange(0, len(items))
            result["아이템"] = items[index]
        elif word == "챔피언":
            index = random.randrange(0, len(champions))
            result["챔피언"] = champions[index]

    return result
